#include <stdio.h>
float filter(float in)
/*
  1. 길이 L인 배열에 입력을 받는다 (L-1개의 과거 입력을 저장)
  2. 컨볼루션 연산을 수행한다
  3. 결과를 txt 파일에 출력한다
*/
{
  static float x[21];
  float h[21] = {
    -0.000306021779757585, 0.00189666282674638, 0.00257299891941012, -0.0090277441097318,
    -0.0075198095107301, 0.0291019349476909, 0.0145629522024416, -0.0807110457423653,
    -0.0210214194708373, 0.308909103630076,  0.523660422383779, 0.308909103630076,
    -0.0210214194708373, -0.0807110457423653,  0.0145629522024416, 0.0291019349476909,
    -0.0075198095107301, -0.0090277441097318,  0.00257299891941012, 0.00189666282674638,
    -0.000306021779757585
  };

  for(int i = 20; i > 0; i--)
    x[i] = x[i-1]; // RShift
  x[0] = in;

  float out = 0;
  for(int i = 0; i < 21; i++)
    out += x[i]*h[i];
  return out;
}

int main(){
  FILE* inf = fopen("input.txt", "r");
  FILE* outf = fopen("output.txt", "w");
  float in;
  while(fscanf(inf, "%f" ,&in) > 0) // 주소 전달
  {
    float out = filter(in);
    fprintf(outf, "%.6f\n", out); // 값 전달
  }
  fclose(inf);
  fclose(outf);
}